# Вывести на консоль своё имя, нарисованное 'звёздочками'. Для выполнения этого задания надо использовать
# не только символы звёздочки и пробела, но и ESCAPE символы: \n и \t

print(' ' *3 + '*\t' + ' ' + '*' *3 + '\t' + '*' + ' ' *3 + '*\t' + '*' + ' ' *4 + '*' + '\n' + ' ' *3 + '*\t' + '*' + ' ' *3 + '*\t' + '*' + ' ' *3 + '*\t' + '*' *2 + ' ' *3 + '*')
print(' ' *3 + '*\t' + '*' + ' ' *3 + '*\t' + '*' *4 + '*\t' + '*' + ' ' + '*' + ' ' *2 + '*')
print('*' + ' ' *2 + '*' + ' \t' + '*' + ' ' *3 + '*\t' + '*' + ' ' *3 + '*\t' + '*' + ' ' *2 + '*' + ' ' + '*')
print(' ' *2 + '*' + ' \t' + ' ' + '*' *3 + '\t' + '*' + ' ' *3 + '*\t' + '*' + ' ' *3 + '*' *2)