# Написать программу, которая выводит в консоль таблицу Escape-последовательностей:

print('Escape sequences')
print('\\a' + ' ' *6 + 'Bell(alert)')
print('\\b' + ' ' *6 + 'Backspace')
print('\\n' + ' ' *6 + 'New line')
print('\\t' + ' ' *6 + 'Horizontal tab')
print(r'\\' + ' ' *6 + 'Backslash \\')
print('\\"' + ' ' *6 + 'Double quotation mark "')
print(r'\'' + ' ' *6 + 'Double quotation mark \'')